#### Terraform Format and Style 🖌`success`
### Workspace
`WORKSPACE`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```hcl
terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/TCC-PIPLINE/WORKSPACE/runs/run-d44fRz2se4CodPwD

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_glue_job.glue_job will be created
  + resource "aws_glue_job" "glue_job" {
      + arn               = (known after apply)
      + default_arguments = {
          + "--additional-python-modules"       = "delta-spark==1.0.0"
          + "--conf spark.delta.logStore.class" = "org.apache.spark.sql.delta.storage.S3SingleDriverLogStore"
          + "--conf spark.sql.extensions"       = "io.delta.sql.DeltaSparkSessionExtension"
          + "--extra-jars"                      = "s3://tcc-scripts-469691162657/jars/delta-core_2.12-1.0.0.jar"
        }
      + glue_version      = "3.0"
      + id                = (known after apply)
      + max_capacity      = (known after apply)
      + name              = "glue-tcc"
      + number_of_workers = 2
      + role_arn          = (known after apply)
      + tags_all          = (known after apply)
      + timeout           = 5
      + worker_type       = "Standard"

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://tcc-scripts-469691162657/jobs/glue-etl.py"
        }
    }

  # aws_iam_role.glue_role will be created
  + resource "aws_iam_role" "glue_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "glue_job_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.glue_job_policy will be created
  + resource "aws_iam_role_policy_attachment" "glue_job_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "glue_job_role"
    }

  # aws_s3_bucket.buckets[0] will be created
  + resource "aws_s3_bucket" "buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tcc-bronze-469691162657"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Project" = "pipeline-dados"
        }
      + tags_all                    = {
          + "Project" = "pipeline-dados"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.buckets[1] will be created
  + resource "aws_s3_bucket" "buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tcc-silver-469691162657"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Project" = "pipeline-dados"
        }
      + tags_all                    = {
          + "Project" = "pipeline-dados"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.buckets[2] will be created
  + resource "aws_s3_bucket" "buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tcc-gold-469691162657"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Project" = "pipeline-dados"
        }
      + tags_all                    = {
          + "Project" = "pipeline-dados"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.buckets[3] will be created
  + resource "aws_s3_bucket" "buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tcc-scripts-469691162657"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Project" = "pipeline-dados"
        }
      + tags_all                    = {
          + "Project" = "pipeline-dados"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.bucket_acl[0] will be created
  + resource "aws_s3_bucket_acl" "bucket_acl" {
      + acl    = "private"
      + bucket = "tcc-bronze-469691162657"
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.bucket_acl[1] will be created
  + resource "aws_s3_bucket_acl" "bucket_acl" {
      + acl    = "private"
      + bucket = "tcc-silver-469691162657"
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.bucket_acl[2] will be created
  + resource "aws_s3_bucket_acl" "bucket_acl" {
      + acl    = "private"
      + bucket = "tcc-gold-469691162657"
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.bucket_acl[3] will be created
  + resource "aws_s3_bucket_acl" "bucket_acl" {
      + acl    = "private"
      + bucket = "tcc-scripts-469691162657"
      + id     = (known after apply)
    }

  # aws_s3_bucket_public_access_block.public_access_block[0] will be created
  + resource "aws_s3_bucket_public_access_block" "public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "tcc-bronze-469691162657"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.public_access_block[1] will be created
  + resource "aws_s3_bucket_public_access_block" "public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "tcc-silver-469691162657"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.public_access_block[2] will be created
  + resource "aws_s3_bucket_public_access_block" "public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "tcc-gold-469691162657"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.public_access_block[3] will be created
  + resource "aws_s3_bucket_public_access_block" "public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "tcc-scripts-469691162657"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.bucket_sse[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "bucket_sse" {
      + bucket = "tcc-bronze-469691162657"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.bucket_sse[1] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "bucket_sse" {
      + bucket = "tcc-silver-469691162657"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.bucket_sse[2] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "bucket_sse" {
      + bucket = "tcc-gold-469691162657"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.bucket_sse[3] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "bucket_sse" {
      + bucket = "tcc-scripts-469691162657"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_object.glue_script will be created
  + resource "aws_s3_object" "glue_script" {
      + acl                    = "private"
      + bucket                 = "tcc-scripts-469691162657"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/x-python"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "jobs/glue-etl.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./files/job/glue-etl.py"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.jars will be created
  + resource "aws_s3_object" "jars" {
      + acl                    = "private"
      + bucket                 = "tcc-scripts-469691162657"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "jars/delta-core_2.12-1.0.0.jar"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./files/jars/delta-core_2.12-1.0.0.jar"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.upload_files will be created
  + resource "aws_s3_object" "upload_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "glue_etl2.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../../../app/glue_etl.py"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 22 to add, 0 to change, 0 to destroy.

```
</details>
**Pusher**: @lucashsmoraes
**Action**: pull_request
